GopalSaraf/Practicals/PSDL/include/proc/pic16hv785.inc
// Register: REFCON
#define REFCON REFCON
REFCON                                   equ 0098h
// bitfield definitions
REFCON_CVROE_POSN                        equ 0001h
REFCON_CVROE_POSITION                    equ 0001h
REFCON_CVROE_SIZE                        equ 0001h
REFCON_CVROE_LENGTH                      equ 0001h
REFCON_CVROE_MASK                        equ 0002h
REFCON_VROE_POSN                         equ 0002h
REFCON_VROE_POSITION                     equ 0002h
REFCON_VROE_SIZE                         equ 0001h
REFCON_VROE_LENGTH                       equ 0001h
REFCON_VROE_MASK                         equ 0004h
REFCON_VREN_POSN                         equ 0003h
REFCON_VREN_POSITION                     equ 0003h
REFCON_VREN_SIZE                         equ 0001h
REFCON_VREN_LENGTH                       equ 0001h
REFCON_VREN_MASK                         equ 0008h
REFCON_VRBB_POSN                         equ 0004h
REFCON_VRBB_POSITION                     equ 0004h
REFCON_VRBB_SIZE                         equ 0001h
REFCON_VRBB_LENGTH                       equ 0001h
REFCON_VRBB_MASK                         equ 0010h
REFCON_BGST_POSN                         equ 0005h
REFCON_BGST_POSITION                     equ 0005h
REFCON_BGST_SIZE                         equ 0001h
REFCON_BGST_LENGTH                       equ 0001h
REFCON_BGST_MASK                         equ 0020h

// Register: VRCON
#define VRCON VRCON
VRCON                                    equ 0099h
// bitfield definitions
VRCON_VR0_POSN                           equ 0000h
VRCON_VR0_POSITION                       equ 0000h
VRCON_VR0_SIZE                           equ 0001h
VRCON_VR0_LENGTH                         equ 0001h
VRCON_VR0_MASK                           equ 0001h
VRCON_VR1_POSN                           equ 0001h
VRCON_VR1_POSITION                       equ 0001h
VRCON_VR1_SIZE                           equ 0001h
VRCON_VR1_LENGTH                         equ 0001h
VRCON_VR1_MASK                           equ 0002h
VRCON_VR2_POSN                           equ 0002h
VRCON_VR2_POSITION                       equ 0002h
VRCON_VR2_SIZE                           equ 0001h
VRCON_VR2_LENGTH                         equ 0001h
VRCON_VR2_MASK                           equ 0004h
VRCON_VR3_POSN                           equ 0003h
VRCON_VR3_POSITION                       equ 0003h
VRCON_VR3_SIZE                           equ 0001h
VRCON_VR3_LENGTH                         equ 0001h
VRCON_VR3_MASK                           equ 0008h
VRCON_VRR_POSN                           equ 0005h
VRCON_VRR_POSITION                       equ 0005h
VRCON_VRR_SIZE                           equ 0001h
VRCON_VRR_LENGTH                         equ 0001h
VRCON_VRR_MASK                           equ 0020h
VRCON_C2VREN_POSN                        equ 0006h
VRCON_C2VREN_POSITION                    equ 0006h
VRCON_C2VREN_SIZE                        equ 0001h
VRCON_C2VREN_LENGTH                      equ 0001h
VRCON_C2VREN_MASK                        equ 0040h
VRCON_C1VREN_POSN                        equ 0007h
VRCON_C1VREN_POSITION                    equ 0007h
VRCON_C1VREN_SIZE                        equ 0001h
VRCON_C1VREN_LENGTH                      equ 0001h
VRCON_C1VREN_MASK                        equ 0080h

// Register: EEDATA
#define EEDATA EEDATA
EEDATA                                   equ 009Ah

// Register: EEADR
#define EEADR EEADR
EEADR                                    equ 009Bh

// Register: EECON1
#define EECON1 EECON1
EECON1                                   equ 009Ch
// bitfield definitions
EECON1_RD_POSN                           equ 0000h
EECON1_RD_POSITION                       equ 0000h
EECON1_RD_SIZE                           equ 0001h
EECON1_RD_LENGTH                         equ 0001h
EECON1_RD_MASK                           equ 0001h
EECON1_WR_POSN                           equ 0001h
EECON1_WR_POSITION                       equ 0001h
EECON1_WR_SIZE                           equ 0001h
EECON1_WR_LENGTH                         equ 0001h
EECON1_WR_MASK                           equ 0002h
EECON1_WREN_POSN                         equ 0002h
EECON1_WREN_POSITION                     equ 0002h
EECON1_WREN_SIZE                         equ 0001h
EECON1_WREN_LENGTH                       equ 0001h
EECON1_WREN_MASK                         equ 0004h
EECON1_WRERR_POSN                        equ 0003h
EECON1_WRERR_POSITION                    equ 0003h
EECON1_WRERR_SIZE                        equ 0001h
EECON1_WRERR_LENGTH                      equ 0001h
EECON1_WRERR_MASK                        equ 0008h

// Register: EECON2
#define EECON2 EECON2
EECON2                                   equ 009Dh

// Register: ADRESL
#define ADRESL ADRESL
ADRESL                                   equ 009Eh

// Register: ADCON1
#define ADCON1 ADCON1
ADCON1                                   equ 009Fh
// bitfield definitions
ADCON1_ADCS_POSN                         equ 0004h
ADCON1_ADCS_POSITION                     equ 0004h
ADCON1_ADCS_SIZE                         equ 0003h
ADCON1_ADCS_LENGTH                       equ 0003h
ADCON1_ADCS_MASK                         equ 0070h
ADCON1_ADCS0_POSN                        equ 0004h
ADCON1_ADCS0_POSITION                    equ 0004h
ADCON1_ADCS0_SIZE                        equ 0001h
ADCON1_ADCS0_LENGTH                      equ 0001h
ADCON1_ADCS0_MASK                        equ 0010h
ADCON1_ADCS1_POSN                        equ 0005h
ADCON1_ADCS1_POSITION                    equ 0005h
ADCON1_ADCS1_SIZE                        equ 0001h
ADCON1_ADCS1_LENGTH                      equ 0001h
ADCON1_ADCS1_MASK                        equ 0020h
ADCON1_ADCS2_POSN                        equ 0006h
ADCON1_ADCS2_POSITION                    equ 0006h
ADCON1_ADCS2_SIZE                        equ 0001h
ADCON1_ADCS2_LENGTH                      equ 0001h
ADCON1_ADCS2_MASK                        equ 0040h

// Register: PWMCON1
#define PWMCON1 PWMCON1
PWMCON1                                  equ 0110h
// bitfield definitions
PWMCON1_CMDLY_POSN                       equ 0000h
PWMCON1_CMDLY_POSITION                   equ 0000h
PWMCON1_CMDLY_SIZE                       equ 0005h
PWMCON1_CMDLY_LENGTH                     equ 0005h
PWMCON1_CMDLY_MASK                       equ 001Fh
PWMCON1_COMOD_POSN                       equ 0005h
PWMCON1_COMOD_POSITION                   equ 0005h
PWMCON1_COMOD_SIZE                       equ 0002h
PWMCON1_COMOD_LENGTH                     equ 0002h
PWMCON1_COMOD_MASK                       equ 0060h
PWMCON1_OVRLP_POSN                       equ 0007h
PWMCON1_OVRLP_POSITION                   equ 0007h
PWMCON1_OVRLP_SIZE                       equ 0001h
PWMCON1_OVRLP_LENGTH                     equ 0001h
PWMCON1_OVRLP_MASK                       equ 0080h
PWMCON1_CMDLY0_POSN                      equ 0000h
PWMCON1_CMDLY0_POSITION                  equ 0000h
PWMCON1_CMDLY0_SIZE                      equ 0001h
PWMCON1_CMDLY0_LENGTH                    equ 0001h
PWMCON1_CMDLY0_MASK                      equ 0001h
PWMCON1_CMDLY1_POSN                      equ 0001h
PWMCON1_CMDLY1_POSITION                  equ 0001h
PWMCON1_CMDLY1_SIZE                      equ 0001h
PWMCON1_CMDLY1_LENGTH                    equ 0001h
PWMCON1_CMDLY1_MASK                      equ 0002h
PWMCON1_CMDLY2_POSN                      equ 0002h
PWMCON1_CMDLY2_POSITION                  equ 0002h
PWMCON1_CMDLY2_SIZE                      equ 0001h
PWMCON1_CMDLY2_LENGTH                    equ 0001h
PWMCON1_CMDLY2_MASK                      equ 0004h
PWMCON1_CMDLY3_POSN                      equ 0003h
PWMCON1_CMDLY3_POSITION                  equ 0003h
PWMCON1_CMDLY3_SIZE                      equ 0001h
PWMCON1_CMDLY3_LENGTH                    equ 0001h
PWMCON1_CMDLY3_MASK                      equ 0008h
PWMCON1_CMDLY4_POSN                      equ 0004h
PWMCON1_CMDLY4_POSITION                  equ 0004h
PWMCON1_CMDLY4_SIZE                      equ 0001h
PWMCON1_CMDLY4_LENGTH                    equ 0001h
PWMCON1_CMDLY4_MASK                      equ 0010h
PWMCON1_COMOD0_POSN                      equ 0005h
PWMCON1_COMOD0_POSITION                  equ 0005h
PWMCON1_COMOD0_SIZE                      equ 0001h
PWMCON1_COMOD0_LENGTH                    equ 0001h
PWMCON1_COMOD0_MASK                      equ 0020h
PWMCON1_COMOD1_POSN                      equ 0006h
PWMCON1_COMOD1_POSITION                  equ 0006h
PWMCON1_COMOD1_SIZE                      equ 0001h
PWMCON1_COMOD1_LENGTH                    equ 0001h
PWMCON1_COMOD1_MASK                      equ 0040h

// Register: PWMCON0
#define PWMCON0 PWMCON0
PWMCON0                                  equ 0111h
// bitfield definitions
PWMCON0_PH1EN_POSN                       equ 0000h
PWMCON0_PH1EN_POSITION                   equ 0000h
PWMCON0_PH1EN_SIZE                       equ 0001h
PWMCON0_PH1EN_LENGTH                     equ 0001h
PWMCON0_PH1EN_MASK                       equ 0001h
PWMCON0_PH2EN_POSN                       equ 0001h
PWMCON0_PH2EN_POSITION                   equ 0001h
PWMCON0_PH2EN_SIZE                       equ 0001h
PWMCON0_PH2EN_LENGTH                     equ 0001h
PWMCON0_PH2EN_MASK                       equ 0002h
PWMCON0_SYNC_POSN                        equ 0002h
PWMCON0_SYNC_POSITION                    equ 0002h
PWMCON0_SYNC_SIZE                        equ 0002h
PWMCON0_SYNC_LENGTH                      equ 0002h
PWMCON0_SYNC_MASK                        equ 000Ch
PWMCON0_BLANK1_POSN                      equ 0004h
PWMCON0_BLANK1_POSITION                  equ 0004h
PWMCON0_BLANK1_SIZE                      equ 0001h
PWMCON0_BLANK1_LENGTH                    equ 0001h
PWMCON0_BLANK1_MASK                      equ 0010h
PWMCON0_BLANK2_POSN                      equ 0005h
PWMCON0_BLANK2_POSITION                  equ 0005h
PWMCON0_BLANK2_SIZE                      equ 0001h
PWMCON0_BLANK2_LENGTH                    equ 0001h
PWMCON0_BLANK2_MASK                      equ 0020h
PWMCON0_PASEN_POSN                       equ 0006h
PWMCON0_PASEN_POSITION                   equ 0006h
PWMCON0_PASEN_SIZE                       equ 0001h
PWMCON0_PASEN_LENGTH                     equ 0001h
PWMCON0_PASEN_MASK                       equ 0040h
PWMCON0_PRSEN_POSN                       equ 0007h
PWMCON0_PRSEN_POSITION                   equ 0007h
PWMCON0_PRSEN_SIZE                       equ 0001h
PWMCON0_PRSEN_LENGTH                     equ 0001h
PWMCON0_PRSEN_MASK                       equ 0080h
PWMCON0_SYNC0_POSN                       equ 0002h
PWMCON0_SYNC0_POSITION                   equ 0002h
PWMCON0_SYNC0_SIZE                       equ 0001h
PWMCON0_SYNC0_LENGTH                     equ 0001h
PWMCON0_SYNC0_MASK                       equ 0004h
PWMCON0_SYNC1_POSN                       equ 0003h
PWMCON0_SYNC1_POSITION                   equ 0003h
PWMCON0_SYNC1_SIZE                       equ 0001h
PWMCON0_SYNC1_LENGTH                     equ 0001h
PWMCON0_SYNC1_MASK                       equ 0008h

