GopalSaraf/Practicals/PSDL/include/proc/pic16hv785.inc
// Register: OPA1CON
#define OPA1CON OPA1CON
OPA1CON                                  equ 011Ch
// bitfield definitions
OPA1CON_OPAON_POSN                       equ 0007h
OPA1CON_OPAON_POSITION                   equ 0007h
OPA1CON_OPAON_SIZE                       equ 0001h
OPA1CON_OPAON_LENGTH                     equ 0001h
OPA1CON_OPAON_MASK                       equ 0080h

// Register: OPA2CON
#define OPA2CON OPA2CON
OPA2CON                                  equ 011Dh
// bitfield definitions
OPA2CON_OPAON_POSN                       equ 0007h
OPA2CON_OPAON_POSITION                   equ 0007h
OPA2CON_OPAON_SIZE                       equ 0001h
OPA2CON_OPAON_LENGTH                     equ 0001h
OPA2CON_OPAON_MASK                       equ 0080h

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ADCS0                            BANKMASK(ADCON1), 4
#define ADCS1                            BANKMASK(ADCON1), 5
#define ADCS2                            BANKMASK(ADCON1), 6
#define ADFM                             BANKMASK(ADCON0), 7
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADON                             BANKMASK(ADCON0), 0
#define ANS0                             BANKMASK(ANSEL0), 0
#define ANS1                             BANKMASK(ANSEL0), 1
#define ANS10                            BANKMASK(ANSEL1), 2
#define ANS11                            BANKMASK(ANSEL1), 3
#define ANS2                             BANKMASK(ANSEL0), 2
#define ANS3                             BANKMASK(ANSEL0), 3
#define ANS4                             BANKMASK(ANSEL0), 4
#define ANS5                             BANKMASK(ANSEL0), 5
#define ANS6                             BANKMASK(ANSEL0), 6
#define ANS7                             BANKMASK(ANSEL0), 7
#define ANS8                             BANKMASK(ANSEL1), 0
#define ANS9                             BANKMASK(ANSEL1), 1
#define BGST                             BANKMASK(REFCON), 5
#define BLANK1                           BANKMASK(PWMCON0), 4
#define BLANK2                           BANKMASK(PWMCON0), 5
#define C1CH0                            BANKMASK(CM1CON0), 0
#define C1CH1                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE1), 3
#define C1IF                             BANKMASK(PIR1), 3
#define C1OE                             BANKMASK(CM1CON0), 5
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1OUT                            BANKMASK(CM1CON0), 6
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1R                              BANKMASK(CM1CON0), 2
#define C1SP                             BANKMASK(CM1CON0), 3
#define C1VREN                           BANKMASK(VRCON), 7
#define C2CH0                            BANKMASK(CM2CON0), 0
#define C2CH1                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE1), 4
#define C2IF                             BANKMASK(PIR1), 4
#define C2OE                             BANKMASK(CM2CON0), 5
#define C2ON                             BANKMASK(CM2CON0), 7
#define C2OUT                            BANKMASK(CM2CON0), 6
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2R                              BANKMASK(CM2CON0), 2
#define C2SP                             BANKMASK(CM2CON0), 3
#define C2SYNC                           BANKMASK(CM2CON1), 0
#define C2VREN                           BANKMASK(VRCON), 6
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1IE                           BANKMASK(PIE1), 5
#define CCP1IF                           BANKMASK(PIR1), 5
#define CCP1M0                           BANKMASK(CCP1CON), 0
#define CCP1M1                           BANKMASK(CCP1CON), 1
#define CCP1M2                           BANKMASK(CCP1CON), 2
#define CCP1M3                           BANKMASK(CCP1CON), 3
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CHS3                             BANKMASK(ADCON0), 5
#define CMDLY0                           BANKMASK(PWMCON1), 0
#define CMDLY1                           BANKMASK(PWMCON1), 1
#define CMDLY2                           BANKMASK(PWMCON1), 2
#define CMDLY3                           BANKMASK(PWMCON1), 3
#define CMDLY4                           BANKMASK(PWMCON1), 4
#define COMOD0                           BANKMASK(PWMCON1), 5
#define COMOD1                           BANKMASK(PWMCON1), 6
#define CVROE                            BANKMASK(REFCON), 1
#define DC                               BANKMASK(STATUS), 1
#define DC1B0                            BANKMASK(CCP1CON), 4
#define DC1B1                            BANKMASK(CCP1CON), 5
#define EEIE                             BANKMASK(PIE1), 7
#define EEIF                             BANKMASK(PIR1), 7
#define GIE                              BANKMASK(INTCON), 7
#define GO                               BANKMASK(ADCON0), 1
#define GO_DONE                          BANKMASK(ADCON0), 1
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define HTS                              BANKMASK(OSCCON), 2
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOC0                             BANKMASK(IOCA), 0
#define IOC1                             BANKMASK(IOCA), 1
#define IOC2                             BANKMASK(IOCA), 2
#define IOC3                             BANKMASK(IOCA), 3
#define IOC4                             BANKMASK(IOCA), 4
#define IOC5                             BANKMASK(IOCA), 5
#define IOCA0                            BANKMASK(IOCA), 0
#define IOCA1                            BANKMASK(IOCA), 1
#define IOCA2                            BANKMASK(IOCA), 2
#define IOCA3                            BANKMASK(IOCA), 3
#define IOCA4                            BANKMASK(IOCA), 4
#define IOCA5                            BANKMASK(IOCA), 5
#define IRCF0                            BANKMASK(OSCCON), 4
#define IRCF1                            BANKMASK(OSCCON), 5
#define IRCF2                            BANKMASK(OSCCON), 6
#define LTS                              BANKMASK(OSCCON), 1
#define MC1OUT                           BANKMASK(CM2CON1), 7
#define MC2OUT                           BANKMASK(CM2CON1), 6
#define OSFIE                            BANKMASK(PIE1), 2
#define OSFIF                            BANKMASK(PIR1), 2
#define OSTS                             BANKMASK(OSCCON), 3
#define OVRLP                            BANKMASK(PWMCON1), 7
#define PASEN                            BANKMASK(PWMCON0), 6
#define PEIE                             BANKMASK(INTCON), 6
#define PER0                             BANKMASK(PWMCLK), 0
#define PER1                             BANKMASK(PWMCLK), 1
#define PER2                             BANKMASK(PWMCLK), 2
#define PER3                             BANKMASK(PWMCLK), 3
#define PER4                             BANKMASK(PWMCLK), 4
#define PH1EN                            BANKMASK(PWMCON0), 0
#define PH2EN                            BANKMASK(PWMCON0), 1
#define PRSEN                            BANKMASK(PWMCON0), 7
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define PWMASE                           BANKMASK(PWMCLK), 7
#define PWMP0                            BANKMASK(PWMCLK), 5
#define PWMP1                            BANKMASK(PWMCLK), 6
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RAIE                             BANKMASK(INTCON), 3
#define RAIF                             BANKMASK(INTCON), 0
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB7                              BANKMASK(PORTB), 7
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC2                              BANKMASK(PORTC), 2
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC7                              BANKMASK(PORTC), 7
#define RD                               BANKMASK(EECON1), 0
#define RP0                              BANKMASK(STATUS), 5
#define RP1                              BANKMASK(STATUS), 6
#define SBODEN                           BANKMASK(PCON), 4
#define SBOREN                           BANKMASK(PCON), 4
#define SCS                              BANKMASK(OSCCON), 0
#define SWDTEN                           BANKMASK(WDTCON), 0
#define SYNC0                            BANKMASK(PWMCON0), 2
#define SYNC1                            BANKMASK(PWMCON0), 3
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GE                             BANKMASK(T1CON), 6
#define T1GINV                           BANKMASK(T1CON), 7
#define T1GSS                            BANKMASK(CM2CON1), 1
#define T1IE                             BANKMASK(PIE1), 0
#define T1IF                             BANKMASK(PIR1), 0
#define T1OSCEN                          BANKMASK(T1CON), 3
#define T2CKPS0                          BANKMASK(T2CON), 0
#define T2CKPS1                          BANKMASK(T2CON), 1
#define T2IE                             BANKMASK(PIE1), 1
#define T2IF                             BANKMASK(PIR1), 1
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR1CS                           BANKMASK(T1CON), 1
#define TMR1GE                           BANKMASK(T1CON), 6
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 2
#define TOUTPS0                          BANKMASK(T2CON), 3
#define TOUTPS1                          BANKMASK(T2CON), 4
#define TOUTPS2                          BANKMASK(T2CON), 5
#define TOUTPS3                          BANKMASK(T2CON), 6
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISB4                           BANKMASK(TRISB), 4
#define TRISB5                           BANKMASK(TRISB), 5
#define TRISB6                           BANKMASK(TRISB), 6
#define TRISB7                           BANKMASK(TRISB), 7
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
#define TRISC6                           BANKMASK(TRISC), 6
#define TRISC7                           BANKMASK(TRISC), 7
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define VCFG                             BANKMASK(ADCON0), 6
#define VR0                              BANKMASK(VRCON), 0
#define VR1                              BANKMASK(VRCON), 1
#define VR2                              BANKMASK(VRCON), 2
#define VR3                              BANKMASK(VRCON), 3
#define VRBB                             BANKMASK(REFCON), 4
#define VREN                             BANKMASK(REFCON), 3
#define VROE                             BANKMASK(REFCON), 2
#define VRR                              BANKMASK(VRCON), 5
#define WDTPS0                           BANKMASK(WDTCON), 1
#define WDTPS1                           BANKMASK(WDTCON), 2
#define WDTPS2                           BANKMASK(WDTCON), 3
#define WDTPS3                           BANKMASK(WDTCON), 4
#define WPU0                             BANKMASK(WPUA), 0
#define WPU1                             BANKMASK(WPUA), 1
#define WPU2                             BANKMASK(WPUA), 2
#define WPU3                             BANKMASK(WPUA), 3
#define WPU4                             BANKMASK(WPUA), 4
#define WPU5                             BANKMASK(WPUA), 5
#define WPUA0                            BANKMASK(WPUA), 0
#define WPUA1                            BANKMASK(WPUA), 1
#define WPUA2                            BANKMASK(WPUA), 2
#define WPUA3                            BANKMASK(WPUA), 3
#define WPUA4                            BANKMASK(WPUA), 4
#define WPUA5                            BANKMASK(WPUA), 5
#define WR                               BANKMASK(EECON1), 1
#define WREN                             BANKMASK(EECON1), 2
#define WRERR                            BANKMASK(EECON1), 3
#define ZERO                             BANKMASK(STATUS), 2
#define nBOD                             BANKMASK(PCON), 0
#define nBOR                             BANKMASK(PCON), 0
#define nDONE                            BANKMASK(ADCON0), 1
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON), 1
#define nRAPU                            BANKMASK(OPTION_REG), 7
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nTO                              BANKMASK(STATUS), 4

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC16HV785_INC_
